app/controllers/movies_controller.rb

SELECT * FROM "movies"
---
  def index
    @movies = Movie.all

SELECT * FROM "movies" WHERE ("movies"."id" = 1)
---
  def show
    @movie = Movie.find(params[:id])

SELECT * FROM "movies" WHERE ("movies"."id" = 1)
---
  def edit
    @movie = Movie.find(params[:id])

INSERT INTO "movies" ("created_at", "title", "updated_at", "path") VALUES('2010-02-15 13:26:34', 'sadf', '2010-02-15 13:26:34', 'sadf')
---
  def create
    @movie = Movie.new(params[:movie])

    respond_to do |format|
      if @movie.save

SELECT * FROM "movies" WHERE ("movies"."id" = 2)
UPDATE "movies" SET "updated_at" = '2010-02-17 01:27:27', "title" = 'a' WHERE "id" = 2
---
  def update
    @movie = Movie.find(params[:id])

    respond_to do |format|
      if @movie.update_attributes(params[:movie])

SELECT * FROM "movies" WHERE ("movies"."id" = 1)
DELETE FROM "movies" WHERE "id" = 1
---
  def destroy
    @movie = Movie.find(params[:id])
    @movie.destroy